api/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1
---
  def check_cpf
    user = User.find_by(cpf: params[:cpf])

SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1
---
  def login
    user = User.find_by(cpf: params[:cpf])

INSERT INTO "users" ("name", "birthday", "email", "phone", "cpf", "password_digest", "role", "created_at", "updated_at") VALUES ('Pedro', '2004-03-29', 'a@a.com', '45991254679', '11111111111', '$2a$12$nT2j/ReLpXzftuUpLXw1nulIF/mT9oyTJ/NySuGtK./Gk87OlqJne', 'citizen', '2025-11-21 14:26:34.305505', '2025-11-21 14:26:34.305505') RETURNING "id"
---
  def register
    user = User.new(user_params)
    user.role = "citizen"
    user.password = params[:password]

    if user.save

SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = 1 LIMIT 1
SELECT "skills".* FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = 1
---
  def profile
    user = User.find_by(cpf: params[:cpf])

    if user
      render json: {
        id: user.id,
        name: user.name,
        cpf: user.cpf,
        role: user.role,
        email: user.email,
        phone: user.phone,
        birthday: user.birthday,
        address: user.address ? {
          street: user.address.street,
          number: user.address.number,
          neighborhood: user.address.neighborhood,
          city: user.address.city,
          state: user.address.state,
          zipcode: user.address.zipcode
        } : nil,
        skills: user.skills.map { |skill| { id: skill.id, name: skill.name } }

SELECT "users".* FROM "users" WHERE "users"."cpf" = '11111111111' LIMIT 1
UPDATE "users" SET "birthday" = '2004-03-28', "updated_at" = '2025-11-21 20:12:52.030961' WHERE "users"."id" = 2
---
  def update_profile
    user = User.find_by(cpf: params[:cpf])

    unless user
      render json: { error: 'User not found' }, status: :not_found
      return
    end

    # Workers cannot update their own profile
    if user.role == 'worker'
      render json: { error: 'Workers cannot update their profile' }, status: :unprocessable_entity
      return
    end

    if user.update(user_params)