api/app/controllers/tasks_controller.rb

  def dashboard
    user = User.find_by(cpf: params[:cpf])
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1

  def map_data
    user = User.find_by(cpf: params[:cpf])
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1

  def create_task_request
    user = User.find_by(cpf: params[:cpf])

    unless user && user.role == 'citizen'
      render json: { error: 'Only citizens can create task requests' }, status: :unauthorized
      return
    end

    task_request = TaskRequest.new(task_request_params)
    task_request.citizen = user
    task_request.status = 'pending'

    if task_request.save
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '12377961991' LIMIT 1
INSERT INTO "task_requests" ("citizen_id", "name", "street", "number", "neighborhood", "city", "state", "zipcode", "latitude", "longitude", "status", "admin_id", "created_at", "updated_at") VALUES (2, 'Teste', 'Zandvoort ', '95', 'Interlagos ', 'Cascavel ', 'PR', '85814330', -24.918289, -53.436424, 'pending', NULL, '2025-11-24 20:24:30.499896', '2025-11-24 20:24:30.499896') RETURNING "id"

  def show
    if params[:type] == 'task_request'
      item = TaskRequest.find(params[:id])
      render json: format_task_request(item, true)
    elsif params[:type] == 'task'
      item = Task.find(params[:id])
---
SELECT "task_requests".* FROM "task_requests" WHERE "task_requests"."id" = 1 LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1

  def update_task_status
    user = User.find_by(cpf: params[:cpf])
    task = Task.find(params[:id])

    unless user && user.role == 'worker' && task.worker_id == user.id
      render json: { error: 'Unauthorized' }, status: :unauthorized
      return
    end

    new_status = params[:status]
    unless %w[in_progress approval_requested].include?(new_status)
      render json: { error: 'Invalid status' }, status: :unprocessable_entity
      return
    end

    if new_status == 'in_progress' && task.initial_date.nil?
      # Set initial_date when starting (only if not already set)
      task.initial_date = Date.today
    end

    task.status = new_status

    if task.save
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '35820583957' LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "status" = 'approval_requested', "updated_at" = '2025-11-24 20:34:05.912308' WHERE "tasks"."id" = 1

  def admin_action
    user = User.find_by(cpf: params[:cpf])
---
SELECT "users".* FROM "users" WHERE "users"."cpf" = '11056887982' LIMIT 1

  def render_admin_dashboard(user)
    # Total task requests
    total_task_requests = TaskRequest.count

    # Tasks with status approval_requested that have been validated (approved or refused)
    validated_tasks = Task.where(status: ['approved_conclusion', 'refused_conclusion']).count

    # Pending task requests (status: pending)
    pending_task_requests = TaskRequest.where(status: 'pending').includes(:citizen).map do |tr|
      {
        id: tr.id,
        name: tr.name,
        status: tr.status,
        citizen_name: tr.citizen.name,
        created_at: tr.created_at,
        address: {
          street: tr.street,
          number: tr.number,
          neighborhood: tr.neighborhood,
          city: tr.city,
          state: tr.state,
          zipcode: tr.zipcode
        }
      }
    end

    # Pending tasks with status approval_requested
    pending_tasks = Task.where(status: 'approval_requested').includes(:worker, :task_request).map do |task|
---
SELECT COUNT(*) FROM "task_requests"
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."status" IN ('approved_conclusion', 'refused_conclusion')
SELECT "task_requests".* FROM "task_requests" WHERE "task_requests"."status" = 'pending'
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = 'approval_requested'

  def render_citizen_map_data(user)
    # Get user's task_requests and their approved tasks
    task_requests = user.task_requests.includes(:task)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_request_id" = 1

  def render_admin_map_data(user, filter = nil)
    pins = []

    # Task requests pending approval/refusal
    if filter.nil? || filter.include?('pending_task_requests')
      TaskRequest.where(status: 'pending').each do |tr|
        pins << {
          id: tr.id,
          type: 'task_request',
          category: 'pending_task_requests',
          name: tr.name,
          status: tr.status,
          latitude: tr.latitude.to_f,
          longitude: tr.longitude.to_f,
          address: {
            street: tr.street,
            number: tr.number,
            neighborhood: tr.neighborhood,
            city: tr.city,
            state: tr.state,
            zipcode: tr.zipcode
          }
        }
      end
    end

    # Tasks without worker
    if filter.nil? || filter.include?('tasks_without_worker')
      Task.where(worker_id: nil).each do |task|
---
SELECT "task_requests".* FROM "task_requests" WHERE "task_requests"."status" = 'pending'
SELECT "tasks".* FROM "tasks" WHERE "tasks"."worker_id" IS NULL


    # Tasks not started by worker
    if filter.nil? || filter.include?('tasks_not_started')
      Task.where.not(worker_id: nil).where(status: 'in_progress', initial_date: nil).each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."worker_id" IS NOT NULL AND "tasks"."status" = 'in_progress' AND "tasks"."initial_date" IS NULL


    # Tasks pending approval/refusal
    if filter.nil? || filter.include?('tasks_pending_approval')
      Task.where(status: 'approval_requested').each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = 'approval_requested'


    # Tasks refused
    if filter.nil? || filter.include?('tasks_refused')
      Task.where(status: 'refused_conclusion').each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = 'refused_conclusion'


    # Tasks concluded (only if filter includes it)
    if filter && filter.include?('tasks_concluded')
      Task.where(status: 'approved_conclusion').each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = 'approved_conclusion'

  def handle_approve_task_request(admin, task_request_id, worker_id)
    task_request = TaskRequest.find(task_request_id)

    unless task_request.status == 'pending'
      render json: { error: 'Task request already processed' }, status: :unprocessable_entity
      return
    end

    task_request.status = 'approved'
    task_request.admin = admin

    if task_request.save
---
SELECT "task_requests".* FROM "task_requests" WHERE "task_requests"."id" = 1 LIMIT 1
UPDATE "task_requests" SET "status" = 'approved', "admin_id" = 1, "updated_at" = '2025-11-24 20:26:18.961933' WHERE "task_requests"."id" = 1

      task = Task.new(
        task_request: task_request,
        name: task_request.name,
        street: task_request.street,
        number: task_request.number,
        neighborhood: task_request.neighborhood,
        city: task_request.city,
        state: task_request.state,
        zipcode: task_request.zipcode,
        latitude: task_request.latitude,
        longitude: task_request.longitude,
        admin: admin,
        worker_id: worker_id,
        status: 'in_progress'
      )

      if task.save
---
INSERT INTO "tasks" ("task_request_id", "name", "street", "number", "neighborhood", "city", "state", "zipcode", "latitude", "longitude", "worker_id", "admin_id", "status", "limit_end_date", "initial_date", "created_at", "updated_at") VALUES (1, 'Teste', 'Zandvoort ', '95', 'Interlagos ', 'Cascavel ', 'PR', '85814330', -24.918289, -53.436424, 3, 1, 'in_progress', NULL, NULL, '2025-11-24 20:26:18.967695', '2025-11-24 20:26:18.967695') RETURNING "id"

    task = Task.find(task_id)

    unless task.status == 'approval_requested'
      render json: { error: 'Task is not awaiting approval' }, status: :unprocessable_entity
      return
    end

    task.status = 'approved_conclusion'
    task.conclusion_date = Date.today

    if task.save
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "status" = 'approved_conclusion', "updated_at" = '2025-11-24 20:48:24.290858', "conclusion_date" = '2025-11-24' WHERE "tasks"."id" = 8