api/app/controllers/users_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" IN (2, 3)
SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" IN (2, 3)
SELECT "users".* FROM "users" WHERE "users"."role" IN ('citizen', 'worker') ORDER BY "users"."name" ASC
---
  def index
    users = User.where(role: ['citizen', 'worker'])
                .includes(:address, :skills)
                .order(:name)

    render json: users.map { |user|

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = 2 LIMIT 1
SELECT "skills".* FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = 2
---
  def show
    user = User.find(params[:id])

    render json: {
      id: user.id,
      name: user.name,
      cpf: user.cpf,
      role: user.role,
      email: user.email,
      phone: user.phone,
      birthday: user.birthday,
      address: user.address ? {
        street: user.address.street,
        number: user.address.number,
        neighborhood: user.address.neighborhood,
        city: user.address.city,
        state: user.address.state,
        zipcode: user.address.zipcode
      } : nil,
      skills: user.skills.map { |skill| { id: skill.id, name: skill.name } }

INSERT INTO "users" ("name", "birthday", "email", "phone", "cpf", "password_digest", "role", "created_at", "updated_at") VALUES ('Teste', '2006-05-12', 'a@aa.com', '12345678907', '12345678900', '$2a$12$IJt1nlnqGqyieforwKwDBOATgzvF0MlhCUpTVz2DMdwbwQFIRI58.', 'worker', '2025-11-21 18:31:41.091868', '2025-11-21 18:31:41.091868') RETURNING "id"
SELECT "skills".* FROM "skills" INNER JOIN "user_skills" ON "skills"."id" = "user_skills"."skill_id" WHERE "user_skills"."user_id" = 3
---
  def create_worker
    user = User.new(user_params)
    user.role = 'worker'
    user.password = params[:password] || SecureRandom.hex(8) # Generate random password if not provided

    if user.save
      # Assign skills if provided
      if params[:skill_ids].present?
        user.skill_ids = params[:skill_ids]
      end

      render json: {
        id: user.id,
        name: user.name,
        cpf: user.cpf,
        role: user.role,
        email: user.email,
        phone: user.phone,
        birthday: user.birthday,
        address: user.address ? {
          street: user.address.street,
          number: user.address.number,
          neighborhood: user.address.neighborhood,
          city: user.address.city,
          state: user.address.state,
          zipcode: user.address.zipcode
        } : nil,
        skills: user.skills.map { |skill| { id: skill.id, name: skill.name } }

SELECT "skills".* FROM "skills" ORDER BY "skills"."name" ASC
---
  def skills
    skills = Skill.all.order(:name)
    render json: skills.map { |skill| { id: skill.id, name: skill.name } }